test/nexj/core/persistence/sql/data/readGroupByCount.xml

<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[5]">
            <Item href="#a"/>
            <Item href="#b"/>
            <Item href="#c"/>
            <Item href="#d"/>
            <Item href="#e"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[3]">
            <Item>lastName</Item>
            <Item>primaryAddress</Item>
            <Item>md</Item>
         </keys>
         <values nc:arrayType="xs:anyType[3]">
            <Item xi:nil="true"/>
            <Item xi:nil="true"/>
            <Item xi:type="xs:boolean">false</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[3]">
            <Item>lastName</Item>
            <Item>primaryAddress</Item>
            <Item>md</Item>
         </keys>
         <values nc:arrayType="xs:anyType[3]">
            <Item xi:type="xs:string">Julius</Item>
            <Item href="#f"/>
            <Item xi:type="xs:boolean">false</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="c">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[3]">
            <Item>lastName</Item>
            <Item>primaryAddress</Item>
            <Item>md</Item>
         </keys>
         <values nc:arrayType="xs:anyType[3]">
            <Item xi:type="xs:string">Smith</Item>
            <Item href="#g"/>
            <Item xi:type="xs:boolean">true</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="d">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[3]">
            <Item>lastName</Item>
            <Item>primaryAddress</Item>
            <Item>md</Item>
         </keys>
         <values nc:arrayType="xs:anyType[3]">
            <Item xi:type="xs:string">Test</Item>
            <Item href="#h"/>
            <Item xi:type="xs:boolean">false</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="e">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[3]">
            <Item>lastName</Item>
            <Item>primaryAddress</Item>
            <Item>md</Item>
         </keys>
         <values nc:arrayType="xs:anyType[3]">
            <Item xi:type="xs:string">Test</Item>
            <Item href="#i"/>
            <Item xi:type="xs:boolean">false</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="f">
         <class>Address</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABg==</Item>
            </values>
         </oid>
      </ns:TransferObject>
      <ns:TransferObject id="g">
         <class>Address</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABA==</Item>
            </values>
         </oid>
      </ns:TransferObject>
      <ns:TransferObject id="h">
         <class>Address</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAw==</Item>
            </values>
         </oid>
      </ns:TransferObject>
      <ns:TransferObject id="i">
         <class>Address</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAQ==</Item>
            </values>
         </oid>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
